In [ ]:
import pandas as pd
import numpy as np

data = {
    "nama": ["Andi", "Budi", "Citra", "Dewi", "Eka", "Fajar", "Budi"],
    "nilai": [80, None, 90, "70", 85, "tidak ikut", None],
    "kelas": ["A", "A", "B", None, "B", "A", "A"]
}

df = pd.DataFrame(data)
df
## disini kita cuma di suruh untuk merapikan data saja
# jadi kita akan menghapus data yang tidak valid pada kolom nilai

    nama       nilai kelas
0   Andi          80     A
1   Budi        None     A
2  Citra          90     B
3   Dewi          70  None
4    Eka          85     B
5  Fajar  tidak ikut     A
6   Budi        None     A

In [2]:
df.info()
df.isnull().sum()
df.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   nama    7 non-null      object
 1   nilai   5 non-null      object
 2   kelas   6 non-null      object
dtypes: object(3)
memory usage: 300.0+ bytes

    nama nilai kelas
0   Andi    80     A
1   Budi  None     A
2  Citra    90     B
3   Dewi    70  None
4    Eka    85     B

In [3]:
df["nilai"] = pd.to_numeric(df["nilai"], errors="coerce")

In [4]:
df["nilai"] = df["nilai"].fillna(df["nilai"].mean())
df["kelas"] = df["kelas"].fillna("Unknown")

In [5]:
df = df.drop_duplicates()

In [7]:
df.loc[:, "status"] = df["nilai"].apply(
    lambda x: "LULUS" if x >= 75 else "TIDAK LULUS"
)

In [8]:
df["nilai"].mean()

np.float64(81.25)

In [9]:
df.groupby("kelas")["nilai"].mean()

kelas
A          80.833333
B          87.500000
Unknown    70.000000
Name: nilai, dtype: float64

In [10]:
df["status"].value_counts()

status
LULUS          5
TIDAK LULUS    1
Name: count, dtype: int64